docs/notification-benchmark-runs/20260913-194011-4bb7d47c/sync-comment-k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: E:\goProject\library\src\GoStudy\AiDevClub\scripts\notification-benchmark.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 35s max duration (incl. graceful stop):
              * notification_write: 20 looping VUs for 30s (gracefulStop: 5s)


running (01.0s), 20/20 VUs, 55 complete and 0 interrupted iterations
notification_write   [   3% ] 20 VUs  01.0s/30s

running (02.0s), 20/20 VUs, 122 complete and 0 interrupted iterations
notification_write   [   7% ] 20 VUs  02.0s/30s

running (03.0s), 20/20 VUs, 195 complete and 0 interrupted iterations
notification_write   [  10% ] 20 VUs  03.0s/30s

running (04.0s), 20/20 VUs, 264 complete and 0 interrupted iterations
notification_write   [  13% ] 20 VUs  04.0s/30s

running (05.0s), 20/20 VUs, 330 complete and 0 interrupted iterations
notification_write   [  17% ] 20 VUs  05.0s/30s

running (06.0s), 20/20 VUs, 399 complete and 0 interrupted iterations
notification_write   [  20% ] 20 VUs  06.0s/30s

running (07.0s), 20/20 VUs, 474 complete and 0 interrupted iterations
notification_write   [  23% ] 20 VUs  07.0s/30s

running (08.0s), 20/20 VUs, 538 complete and 0 interrupted iterations
notification_write   [  27% ] 20 VUs  08.0s/30s

running (09.0s), 20/20 VUs, 608 complete and 0 interrupted iterations
notification_write   [  30% ] 20 VUs  09.0s/30s

running (10.0s), 20/20 VUs, 681 complete and 0 interrupted iterations
notification_write   [  33% ] 20 VUs  10.0s/30s

running (11.0s), 20/20 VUs, 746 complete and 0 interrupted iterations
notification_write   [  37% ] 20 VUs  11.0s/30s

running (12.0s), 20/20 VUs, 817 complete and 0 interrupted iterations
notification_write   [  40% ] 20 VUs  12.0s/30s

running (13.0s), 20/20 VUs, 885 complete and 0 interrupted iterations
notification_write   [  43% ] 20 VUs  13.0s/30s

running (14.0s), 20/20 VUs, 951 complete and 0 interrupted iterations
notification_write   [  47% ] 20 VUs  14.0s/30s

running (15.0s), 20/20 VUs, 1024 complete and 0 interrupted iterations
notification_write   [  50% ] 20 VUs  15.0s/30s

running (16.0s), 20/20 VUs, 1092 complete and 0 interrupted iterations
notification_write   [  53% ] 20 VUs  16.0s/30s

running (17.0s), 20/20 VUs, 1157 complete and 0 interrupted iterations
notification_write   [  57% ] 20 VUs  17.0s/30s

running (18.0s), 20/20 VUs, 1230 complete and 0 interrupted iterations
notification_write   [  60% ] 20 VUs  18.0s/30s

running (19.0s), 20/20 VUs, 1296 complete and 0 interrupted iterations
notification_write   [  63% ] 20 VUs  19.0s/30s

running (20.0s), 20/20 VUs, 1363 complete and 0 interrupted iterations
notification_write   [  67% ] 20 VUs  20.0s/30s

running (21.0s), 20/20 VUs, 1433 complete and 0 interrupted iterations
notification_write   [  70% ] 20 VUs  21.0s/30s

running (22.0s), 20/20 VUs, 1501 complete and 0 interrupted iterations
notification_write   [  73% ] 20 VUs  22.0s/30s

running (23.0s), 20/20 VUs, 1573 complete and 0 interrupted iterations
notification_write   [  77% ] 20 VUs  23.0s/30s

running (24.0s), 20/20 VUs, 1642 complete and 0 interrupted iterations
notification_write   [  80% ] 20 VUs  24.0s/30s

running (25.0s), 20/20 VUs, 1708 complete and 0 interrupted iterations
notification_write   [  83% ] 20 VUs  25.0s/30s

running (26.0s), 20/20 VUs, 1778 complete and 0 interrupted iterations
notification_write   [  87% ] 20 VUs  26.0s/30s

running (27.0s), 20/20 VUs, 1849 complete and 0 interrupted iterations
notification_write   [  90% ] 20 VUs  27.0s/30s

running (28.0s), 20/20 VUs, 1918 complete and 0 interrupted iterations
notification_write   [  93% ] 20 VUs  28.0s/30s

running (29.0s), 20/20 VUs, 1988 complete and 0 interrupted iterations
notification_write   [  97% ] 20 VUs  29.0s/30s

running (30.0s), 20/20 VUs, 2056 complete and 0 interrupted iterations
notification_write   [ 100% ] 20 VUs  30.0s/30s


  █ TOTAL RESULTS 

    checks_total.......: 2079    68.624289/s
    checks_succeeded...: 100.00% 2079 out of 2079
    checks_failed......: 0.00%   0 out of 2079

    ✓ comment endpoint returns HTTP 200

    CUSTOM
    benchmark_error_rate...........: 0.00%  0 out of 2079
    benchmark_request_duration.....: avg=290.03ms min=200.15ms med=290.72ms max=367.59ms p(90)=312.26ms p(95)=320.2ms  p(99)=332.82ms
    benchmark_requests.............: 2079   68.624289/s

    HTTP
    http_req_duration..............: avg=290.03ms min=200.15ms med=290.72ms max=367.59ms p(90)=312.26ms p(95)=320.2ms  p(99)=332.82ms
      { expected_response:true }...: avg=290.03ms min=200.15ms med=290.72ms max=367.59ms p(90)=312.26ms p(95)=320.2ms  p(99)=332.82ms
    http_req_failed................: 0.00%  0 out of 2079
    http_reqs......................: 2079   68.624289/s

    EXECUTION
    iteration_duration.............: avg=290.39ms min=200.13ms med=290.75ms max=385.64ms p(90)=312.81ms p(95)=320.66ms p(99)=345.16ms
    iterations.....................: 2079   68.624289/s
    vus............................: 20     min=20        max=20
    vus_max........................: 20     min=20        max=20

    NETWORK
    data_received..................: 347 kB 12 kB/s
    data_sent......................: 812 kB 27 kB/s



running (30.3s), 00/20 VUs, 2079 complete and 0 interrupted iterations
notification_write ✓ [ 100% ] 20 VUs  30s